In [1]:
import pandas as pd

# Criando, lendo e escrevendo

In [2]:
#Criando um DataFrame
eletronicos_marca = pd.DataFrame({'Eletrônicos' : ['Computador', 'Celular', 'Tablet'],
                                 'Marca' : ['Lenovo', 'Motorola', 'Apple']})

eletronicos_marca

  Eletrônicos     Marca
0  Computador    Lenovo
1     Celular  Motorola
2      Tablet     Apple

In [3]:
#Alterando o index de um DataFrame
eletronico_marca = pd.DataFrame({'Eletrônicos' : ['Computador', 'Celular', 'Tablet'],
                                 'Marca' : ['Lenovo', 'Motorola', 'Apple']},
                                index=['A', 'B', 'C'])

eletronico_marca

  Eletrônicos     Marca
A  Computador    Lenovo
B     Celular  Motorola
C      Tablet     Apple

In [4]:
#Criando uma Serie
serie = pd.Series(['Computador', 'Celular', 'Tablet'])

serie

0    Computador
1       Celular
2        Tablet
dtype: object

In [5]:
#Alterando o index e adicionando um nome a Serie
serie = pd.Series(['Computador', 'Celular', 'Tablet'], 
                  index=['A', 'B', 'C'], 
                  name= 'Eletrônicos')

serie

A    Computador
B       Celular
C        Tablet
Name: Eletrônicos, dtype: object

In [6]:
#### Lendo um arquivo CSV
arquivo = pd.read_csv(r'C:\Users\marco\Projetos\Python\Titanic challenge\train.csv', sep = ',')
arquivo

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

#### Salvando o DataFrame no disco
eletronico_marca.to_csv('teste')

# Indexação, seleção de & Atribuir

In [7]:
#Acessando uma coluna
arquivo.Sex

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [8]:
#Acessando uma coluna por indexação
arquivo['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [9]:
#Acessando o index de uma coluna
arquivo['Sex'][0]

'male'

### Index-based (método .iloc)

In [10]:
#Selecionando a primeira linha
arquivo.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [11]:
#Selecionando a todas as linhas da primeira coluna
arquivo.iloc[:, 0]

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [12]:
#Selecionando a todas as linhas da primeira à terceira coluna
arquivo.iloc[:5, :3]

   PassengerId  Survived  Pclass
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

In [13]:
#Selecionando index desejados em forma de lista
arquivo.iloc[[0, 3, 5], [0, 3, 5]]

   PassengerId                                          Name   Age
0            1                       Braund, Mr. Owen Harris  22.0
3            4  Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
5            6                              Moran, Mr. James   NaN

In [14]:
#Invertendo index de crescente para decrescente
arquivo.iloc[-5:, -1:]

    Embarked
886        S
887        S
888        S
889        C
890        Q

### Label-based selection (método .loc)

In [15]:
#Selecionando uma coluna
arquivo.loc[:, 'Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [16]:
#Selecionando mais de uma coluna
arquivo.loc[:5, ['Sex', 'Name']]

      Sex                                               Name
0    male                            Braund, Mr. Owen Harris
1  female  Cumings, Mrs. John Bradley (Florence Briggs Th...
2  female                             Heikkinen, Miss. Laina
3  female       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4    male                           Allen, Mr. William Henry
5    male                                   Moran, Mr. James

In [17]:
#Substituindo o index por uma coluna
arquivo.set_index('Sex')

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
male,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,S
female,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,C
female,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
female,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,S
male,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
male,887,0,2,"Montvila, Rev. Juozas",27.0,0,0,211536,13.0000,NaN,S
female,888,1,1,"Graham, Miss. Margaret Edith",19.0,0,0,112053,30.0000,B42,S
female,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 6607,23.4500,NaN,S
male,890,1,1,"Behr, Mr. Karl Howell",26.0,0,0,111369,30.0000,C148,C
male,891,0,3,"Dooley, Mr. Patrick",32.0,0,0,370376,7.7500,NaN,Q

### Seleção condicional

In [18]:
#Identificando se o passageiro é do gênero masculino
arquivo.Sex == 'male'

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Sex, Length: 891, dtype: bool

In [19]:
#Filtrando passageiros do gênero masculino
arquivo.loc[arquivo.Sex == 'male']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [20]:
#Filtrando passageiros do gênero masculino E com idade >= 30
arquivo.loc[(arquivo.Sex == 'male') & (arquivo.Age >= 30)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
...,...,...,...,...,...,...,...,...,...,...,...,...
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [21]:
#Filtrando passageiros do gênero masculino OU que tenham idade <= 20
arquivo.loc[(arquivo.Sex == 'male') | (arquivo.Age <= 30)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
#Selecionando passageiros que embarcaram em C e Q
arquivo.loc[arquivo.Embarked.isin(['C', 'Q'])]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [23]:
#Visualizando registros com dados de idade vazio
arquivo.loc[arquivo.Age.isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [24]:
#Visualizando registros com dados de idade não nulos
arquivo.loc[arquivo.Age.notnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [25]:
#Agregando um valor constante a uma coluna
arquivo2 = pd.read_csv(r'C:\Users\marco\Projetos\Python\Titanic challenge\train.csv', sep = ',')
arquivo2['Sex'] = 'Não mencionado'
arquivo2.iloc[:, 3:5].head()

                                                Name             Sex
0                            Braund, Mr. Owen Harris  Não mencionado
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  Não mencionado
2                             Heikkinen, Miss. Laina  Não mencionado
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  Não mencionado
4                           Allen, Mr. William Henry  Não mencionado

In [26]:
#Agregando valores por meio de iteração
arquivo2['PassengerId'] = range(len(arquivo2), 0, -1)
arquivo2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,891,0,3,"Braund, Mr. Owen Harris",Não mencionado,22.0,1,0,A/5 21171,7.2500,NaN,S
1,890,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Não mencionado,38.0,1,0,PC 17599,71.2833,C85,C
2,889,1,3,"Heikkinen, Miss. Laina",Não mencionado,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,888,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Não mencionado,35.0,1,0,113803,53.1000,C123,S
4,887,0,3,"Allen, Mr. William Henry",Não mencionado,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,5,0,2,"Montvila, Rev. Juozas",Não mencionado,27.0,0,0,211536,13.0000,NaN,S
887,4,1,1,"Graham, Miss. Margaret Edith",Não mencionado,19.0,0,0,112053,30.0000,B42,S
888,3,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",Não mencionado,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,2,1,1,"Behr, Mr. Karl Howell",Não mencionado,26.0,0,0,111369,30.0000,C148,C
890,1,0,3,"Dooley, Mr. Patrick",Não mencionado,32.0,0,0,370376,7.7500,NaN,Q

# Summary functions e Maps

### Summary functions

In [27]:
#Método describe para numéricos
arquivo.Age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [28]:
#Describe para strings
arquivo.Sex.describe()

count      891
unique       2
top       male
freq       577
Name: Sex, dtype: object

In [29]:
#Método mean
arquivo.Age.mean()

29.69911764705882

In [30]:
#Método .unique()
arquivo.Sex.unique()

array(['male', 'female'], dtype=object)

In [31]:
#Método .value_counts()
arquivo.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

### Maps

In [32]:
#Método .map()
idade_media = arquivo.Age.mean()
arquivo.Age.map(lambda x: x - idade_media)

0      -7.699118
1       8.300882
2      -3.699118
3       5.300882
4       5.300882
         ...
886    -2.699118
887   -10.699118
888          NaN
889    -3.699118
890     2.300882
Name: Age, Length: 891, dtype: float64

In [33]:
#Diferença simples
idade_media = arquivo.Age.mean()
arquivo.Age - idade_media

0      -7.699118
1       8.300882
2      -3.699118
3       5.300882
4       5.300882
         ...
886    -2.699118
887   -10.699118
888          NaN
889    -3.699118
890     2.300882
Name: Age, Length: 891, dtype: float64

In [34]:
#AJuntando duas colunas no formato string
arquivo.Name + ' Embarcou na região ' + arquivo.Embarked

0           Braund, Mr. Owen Harris Embarcou na região S
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2            Heikkinen, Miss. Laina Embarcou na região S
3      Futrelle, Mrs. Jacques Heath (Lily May Peel) E...
4          Allen, Mr. William Henry Embarcou na região S
                             ...
886           Montvila, Rev. Juozas Embarcou na região S
887    Graham, Miss. Margaret Edith Embarcou na região S
888    Johnston, Miss. Catherine Helen "Carrie" Embar...
889           Behr, Mr. Karl Howell Embarcou na região C
890             Dooley, Mr. Patrick Embarcou na região Q
Length: 891, dtype: object

In [35]:
#Método .apply()
def media(x):
    x.Age = x.Age - arquivo.Age.mean()
    return x
arquivo.apply(media, axis = 'columns')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,-7.699118,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,8.300882,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,-3.699118,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,5.300882,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,5.300882,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,-2.699118,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,-10.699118,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,-3.699118,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,2.300882,0,0,370376,7.7500,NaN,Q

# Agrupando e ordenando

### Análise de grupos

In [36]:
#Método .gorupby() e count()
arquivo.groupby('Sex').Sex.count()

Sex
female    314
male      577
Name: Sex, dtype: int64

In [37]:
#Método .gorupby() e max()
arquivo.groupby('Sex').Age.max()

Sex
female    63.0
male      80.0
Name: Age, dtype: float64

In [38]:
#Método .gorupby() e apply()
arquivo.groupby(['Sex', 'Survived']).apply(lambda x: x.loc[x.Age.idxmax()])

                 PassengerId  Survived  Pclass  \
Sex    Survived
female 0                 773         0       2
       1                 276         1       1
male   0                 852         0       3
       1                 631         1       1

                                                 Name     Sex   Age  SibSp  \
Sex    Survived
female 0                            Mack, Mrs. (Mary)  female  57.0      0
       1            Andrews, Miss. Kornelia Theodosia  female  63.0      1
male   0                          Svensson, Mr. Johan    male  74.0      0
       1         Barkworth, Mr. Algernon Henry Wilson    male  80.0      0

                 Parch       Ticket     Fare Cabin Embarked
Sex    Survived
female 0             0  S.O./P.P. 3  10.5000   E77        S
       1             0        13502  77.9583    D7        S
male   0             0       347060   7.7750   NaN        S
       1             0        27042  30.0000   A23        S

In [39]:
#Group by + .agg()
arquivo.groupby('Sex').Age.agg([len, min, max])

        len   min   max
Sex
female  314  0.75  63.0
male    577  0.42  80.0

In [40]:
#Multi-index
arquivo.groupby(['Sex','Embarked']).Age.agg([len, min, max])

                 len    min   max
Sex    Embarked
female C          73   0.75  60.0
       Q          36  15.00  39.0
       S         203   1.00  63.0
male   C          95   0.42  71.0
       Q          41   2.00  70.5
       S         441   0.67  80.0

### Ordenando

In [41]:
#Ordenando por sort_values() de forma crescente
x = arquivo.groupby(['Sex','Embarked']).Age.agg([len, min, max])
x.sort_values(by = 'len')

                 len    min   max
Sex    Embarked
female Q          36  15.00  39.0
male   Q          41   2.00  70.5
female C          73   0.75  60.0
male   C          95   0.42  71.0
female S         203   1.00  63.0
male   S         441   0.67  80.0

In [42]:
#Ordenando por sort_values() de forma decrescente
x = arquivo.groupby(['Sex','Embarked']).Age.agg([len, min, max])
x.sort_values(by = 'len', ascending = False)

                 len    min   max
Sex    Embarked
male   S         441   0.67  80.0
female S         203   1.00  63.0
male   C          95   0.42  71.0
female C          73   0.75  60.0
male   Q          41   2.00  70.5
female Q          36  15.00  39.0

In [43]:
#Ordenando por mais de uma coluna por vez
x = arquivo.groupby(['Sex','Embarked']).Age.agg([len, min, max])
x.sort_values(by = ['Sex', 'Embarked'])

                 len    min   max
Sex    Embarked
female C          73   0.75  60.0
       Q          36  15.00  39.0
       S         203   1.00  63.0
male   C          95   0.42  71.0
       Q          41   2.00  70.5
       S         441   0.67  80.0

# Tipo de dado e valores faltantes

### Dtypes

In [56]:
#Identificando o tipo de dado com .dtype
arquivo.Age.dtype

dtype('float64')

In [60]:
#Identificando o tipo de todas as colunas com dtypes
arquivo.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [64]:
#Alterando o tipo do dado com .astype()
arquivo.PassengerId.astype('float')

0        1.0
1        2.0
2        3.0
3        4.0
4        5.0
       ...
886    887.0
887    888.0
888    889.0
889    890.0
890    891.0
Name: PassengerId, Length: 891, dtype: float64

### Valores faltantes

In [71]:
#Encontrando valores nulos
arquivo[pd.isnull(arquivo.Age)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [95]:
#Substituindo valores nulos
arquivo.Age.fillna(arquivo['Age'].mode(), inplace = True)
arquivo.Age.describe()

count    891.000000
mean      29.699118
std       13.002015
min        0.420000
25%       22.000000
50%       29.699118
75%       35.000000
max       80.000000
Name: Age, dtype: float64

In [89]:
#Substituindo valores nulos
arquivo.Cabin.fillna('Desconhecido')

0      Desconhecido
1               C85
2      Desconhecido
3              C123
4      Desconhecido
           ...
886    Desconhecido
887             B42
888    Desconhecido
889            C148
890    Desconhecido
Name: Cabin, Length: 891, dtype: object

In [103]:
#Substituindo valores específicos com o métdo .replace()
arquivo['Sex'].replace(['male', 'female'], ['M', 'F'], inplace= True)
arquivo.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",M,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",F,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",F,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",F,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",M,35.0,0,0,373450,8.0500,NaN,S

# Renomeando e combinando

### Renomenado

In [110]:
#Renomeando uma coluna
arquivo.rename(columns={'Sex' : 'Gender'}). head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",M,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",F,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",F,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",F,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",M,35.0,0,0,373450,8.0500,NaN,S

In [115]:
#Renomeando uma coluna
arquivo2.rename(index={0 : '1º', 1 : '2º', 2 : '3º'}, inplace= True)

In [118]:
#Renomeando o index
arquivo2.rename_axis('index', axis = 'columns').head()

index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1º,891,0,3,"Braund, Mr. Owen Harris",Não mencionado,22.0,1,0,A/5 21171,7.2500,NaN,S
2º,890,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Não mencionado,38.0,1,0,PC 17599,71.2833,C85,C
3º,889,1,3,"Heikkinen, Miss. Laina",Não mencionado,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,888,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Não mencionado,35.0,1,0,113803,53.1000,C123,S
4,887,0,3,"Allen, Mr. William Henry",Não mencionado,35.0,0,0,373450,8.0500,NaN,S

### Combinando

In [121]:
#Combinando com .concat()
eletronicos_marca = pd.DataFrame({'Produto' : ['Computador', 'Celular', 'Tablet'],
                                 'Marca' : ['Lenovo', 'Motorola', 'Apple']})

perifericos_marca = pd.DataFrame({'Produto': ['Teclado', 'Mouse', 'Fone de Ouvido'],
    'Marca': ['Logitech', 'Razer', 'Bose']})

pd.concat([eletronicos_marca, perifericos_marca])

          Produto     Marca
0      Computador    Lenovo
1         Celular  Motorola
2          Tablet     Apple
0         Teclado  Logitech
1           Mouse     Razer
2  Fone de Ouvido      Bose

In [124]:
#Combinando com .join()
eletronicos_marca.join(perifericos_marca, lsuffix= '_Eletrônicos', rsuffix='_Periféricos')

  Produto_Eletrônicos Marca_Eletrônicos Produto_Periféricos Marca_Periféricos
0          Computador            Lenovo             Teclado          Logitech
1             Celular          Motorola               Mouse             Razer
2              Tablet             Apple      Fone de Ouvido              Bose